{
  "name": "Vinh Tran",
  "title": "Business Systems Analyst",
  "location": "Ho Chi Minh City, Vietnam",
  "email": "vinhtran26114@gmail.com",
  "linkedin": "LinkedIn",
  "summary": "Business Systems Analyst focused on making billing and EDI work reliably across teams. I translate complex rules into clear BR/AC, validate with SQL, and keep Billing, EDI, Ops, and Dev moving in sync. Account Receivable Transformation (2023, CES Vietnam and Capco) was completed and handed into steady state. Change of Ownership logic redesign was delivered and is now maintained to protect billing accuracy. With a .NET and JavaScript background, I design practical integrations and verify outcomes rather than assumptions.",
  "experience": [
    {
      "company": "Customized Energy Solutions/BLUE",
      "roles": [
        {
          "title": "Business Systems Analyst (Integration)",
          "duration": "Aug 2023 – Present",
          "responsibilities": [
            "Write business requirements and acceptance criteria for integration projects.",
            "Validate data flows and fixes using SQL in QA, UAT, and Production.",
            "Coordinate with Billing, EDI, and Ops to resolve issues and improve processes."
          ]
        },
        {
          "title": "Software Engineer",
          "duration": "Feb 2022 – Aug 2023",
          "responsibilities": [
            "Maintained the Billing Load Usage and EDI system (BLUE).",
            "Achieved 120% of KPI performance in 2022.",
            "Key achievements: 2023: On-Site US, Philadelphia, supported initial demo session of Account Receivable Transformation (ART) to stakeholders.",
            "2024: Delivery the ART project with CES Vietnam and Capco India under a waterfall model.",
            "2025: Leading the Change of Ownership logic redesign to improve billing accuracy.",
            "Reduced billing mismatches by refining COO and DST rules.",
            "Cut rework by delivering structured BRs and ACs and verifying fixes with SQL."
          ]
        }
      ],
      "techStack": ".NET (C#), SQL Server, SSIS, EDI workflows"
    },
    {
      "company": "NOIS Co., Ltd.",
      "roles": [
        {
          "title": "NET Developer / Team Lead",
          "duration": "Jun 2016 – Feb 2022",
          "responsibilities": [
            "Started as an intern in ElasticSearch and NoSQL R&D, promoted to Developer in 2017 and Team Lead in 2018.",
            "Collected requirements directly from international clients and delivered features and fixes.",
            "Led a team of 6 to 8 developers focused on healthcare and aged care systems."
          ]
        }
      ],
      "projects": [
        "Interference Management System for Insightus. RF interference monitoring with antenna KPIs, spectrum data, and visual dashboards.",
        "Maison Sainte Claire. French language school platform for teachers, students, schedules, and learning progress.",
        "Oracle CMS, Philippines. Maintained the Call Scripter platform onsite, guiding agents through issue logging and escalation workflows.",
        "Smart Space Pro. Workplace management and wayfinding with booking automation and utilization analytics.",
        "Sapphire Care, BlueCross. Aged care system for resident health profiles, reporting, and staff management.",
        "myPak Solutions. Dose Administration Aid medication management with pharmacy integration and virtual pill box."
      ],
      "techStack": ".NET (C#), ASP.NET MVC, JavaScript (AngularJS, jQuery), SQL Server, SSIS, ElasticSearch, NoSQL"
    }
  ],
  "education": [
    {
      "institution": "HCMC Open University",
      "degree": "Bachelor of Computer Science",
      "duration": "2013 – 2017"
    }
  ],
  "skills": {
    "businessAnalysis": [
      "Business Requirements",
      "Acceptance Criteria",
      "Billing Systems",
      "EDI 814, 820, 867",
      "System Integration"
    ],
    "technical": [
      "SQL for validation and RCA",
      ".NET (C#)",
      "ASP.NET MVC",
      "JavaScript (AngularJS, jQuery)",
      "SQL Server",
      "SSIS",
      "API Integration"
    ],
    "collaboration": [
      "Leading Meetings",
      "Interpersonal Communication",
      "Technical Translation",
      "Team Leadership"
    ]
  }
} 